package almaz.kg.investment.modeling.scala.helpers

import scala.io.StdIn

object MainHelper {

  def printWelcomeMessage(): Unit = {
    val ascii_art = "" +
      "_________ _                 _______  _______ _________ _______  _______  _       _________  \n\\__   __/( (    /||\\     /|(  ____ \\(  ____ \\\\__   __/(       )(  ____ \\( (    /|\\__   __/  \n   ) (   |  \\  ( || )   ( || (    \\/| (    \\/   ) (   | () () || (    \\/|  \\  ( |   ) (     \n   | |   |   \\ | || |   | || (__    | (_____    | |   | || || || (__    |   \\ | |   | |     \n   | |   | (\\ \\) |( (   ) )|  __)   (_____  )   | |   | |(_)| ||  __)   | (\\ \\) |   | |     \n   | |   | | \\   | \\ \\_/ / | (            ) |   | |   | |   | || (      | | \\   |   | |     \n___) (___| )  \\  |  \\   /  | (____/\\/\\____) |   | |   | )   ( || (____/\\| )  \\  |   | |     \n\\_______/|/    )_)   \\_/   (_______/\\_______)   )_(   |/     \\|(_______/|/    )_)   )_(     \n                                                                                            \n     _______  _______  ______   _______  _       _________ _        _______                 \n    (       )(  ___  )(  __  \\ (  ____ \\( \\      \\__   __/( (    /|(  ____ \\                \n    | () () || (   ) || (  \\  )| (    \\/| (         ) (   |  \\  ( || (    \\/                \n    | || || || |   | || |   ) || (__    | |         | |   |   \\ | || |                      \n    | |(_)| || |   | || |   | ||  __)   | |         | |   | (\\ \\) || | ____                 \n    | |   | || |   | || |   ) || (      | |         | |   | | \\   || | \\_  )                \n    | )   ( || (___) || (__/  )| (____/\\| (____/\\___) (___| )  \\  || (___) | _  _  _        \n    |/     \\|(_______)(______/ (_______/(_______/\\_______/|/    )_)(_______)(_)(_)(_)    " +
      "\n\n"
    val welcomeMessage = "Добро пожаловать в программу Investment Modeling Scala..." +
      "\nДанная программа эмулирует портфель инвестора, предоставляя различные " +
      "варианты рыночных действий"

    val helpMessage = "Для получения подсказки введите `help`"

    println(ascii_art)
    println(welcomeMessage)
    println(helpMessage)
  }


  def readIntValue(): Int = {
    try {
      StdIn.readLine("$- ").toInt
    }
    catch {
      case nfe: NumberFormatException => 100000
    }
  }
}
